tests/integration_tests/openfoam/cavity_benchmark/benchmark_validation/Re_1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Cavity dimensions (unit square)
convertToMeters 1.0;

// Mesh resolution: 120×120 (Re=1000)
vertices
(
    (0 0 0)    // 0
    (1 0 0)    // 1  
    (1 1 0)    // 2
    (0 1 0)    // 3
    (0 0 0.1)  // 4 (front face)
    (1 0 0.1)  // 5
    (1 1 0.1)  // 6
    (0 1 0.1)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 120 1) 
    simpleGrading 
    (
        1                               // x-direction (uniform)
        (                               // y-direction (graded for boundary layers)
            (0.25 0.3 4)               // bottom 25%: 30% cells, expansion 4
            (0.50 0.4 1)               // middle 50%: 40% cells, uniform  
            (0.25 0.3 0.25)            // top 25%: 30% cells, compression 0.25
        )
        1                               // z-direction (uniform)
    )
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)  // top wall (moving lid)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)  // left wall
            (2 6 5 1)  // right wall
            (1 5 4 0)  // bottom wall
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)  // back face
            (4 5 6 7)  // front face
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
